## Ejercicio - pandas 3

In [602]:
import numpy as np
import pandas as pd

In [603]:
# Versiones

print(f"numpy=={np.__version__}")
print(f"pandas=={pd.__version__}")

numpy==2.2.0
pandas==2.2.3

### Ejercicio 0:
- Carga ambos archivos **titanic_1.csv** y **titanic_2.csv** y guardalos en **df1** y **df2** respectivamente:

In [604]:
df1 = pd.read_csv("./Data/titanic_1.csv")
df2 = pd.read_csv("./Data/titanic_2.csv")

### Ejercicio 1:
- Mostrar las estadisticas de cada uno de los DataFrames.

In [605]:
df1.describe(include="all").T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
PassengerId,891.0,NaN,NaN,NaN,446.0,257.353842,1.0,223.5,446.0,668.5,891.0
Name,891,891,"Dooley, Mr. Patrick",1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Sex,891,2,male,577,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Age,714.0,NaN,NaN,NaN,29.699118,14.526497,0.42,20.125,28.0,38.0,80.0

In [606]:
df2.describe(include="all").T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
PassengerId,891.0,NaN,NaN,NaN,446.0,257.353842,1.0,223.5,446.0,668.5,891.0
Survived,891.0,NaN,NaN,NaN,0.383838,0.486592,0.0,0.0,0.0,1.0,1.0
Pclass,891.0,NaN,NaN,NaN,2.308642,0.836071,1.0,2.0,3.0,3.0,3.0
Ticket,891,681,347082,7,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Fare,891.0,NaN,NaN,NaN,32.204208,49.693429,0.0,7.9104,14.4542,31.0,512.3292

### Ejercicio 2:
- Unir los DataFrames para obtener solo uno.

In [607]:
df = pd.merge(df1, df2)
df.head(2)

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
0,1,"Braund, Mr. Owen Harris",male,22.0,0,3,A/5 21171,7.2500
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,1,PC 17599,71.2833

In [608]:
# df = pd.merge(left = df1, right = df2, left_on = "PassengerId", right_on = "PassengerId", how = "inner")

### Ejercicio 3:
- Imprimir las últimas 5 filas de las columnas de nombre y edad

In [609]:
df[["Name", "Age"]].tail(5)

                                         Name   Age
886                     Montvila, Rev. Juozas  27.0
887              Graham, Miss. Margaret Edith  19.0
888  Johnston, Miss. Catherine Helen "Carrie"   NaN
889                     Behr, Mr. Karl Howell  26.0
890                       Dooley, Mr. Patrick  32.0

### Ejercicio 4:
- Imprimir las primeras 10 filas de las instancias que en sexo sean igual a femenino.

In [610]:
df[df["Sex"] == "female"].head(10)

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,1,PC 17599,71.2833
2,3,"Heikkinen, Miss. Laina",female,26.0,1,3,STON/O2. 3101282,7.9250
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,1,113803,53.1000
8,9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,1,3,347742,11.1333
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,2,237736,30.0708
10,11,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,3,PP 9549,16.7000
11,12,"Bonnell, Miss. Elizabeth",female,58.0,1,1,113783,26.5500
14,15,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,3,350406,7.8542
15,16,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,1,2,248706,16.0000
18,19,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,0,3,345763,18.0000

### Ejercicio 5:
- Imprimir las instancias que en la columna **Fare** sean menor a 33 y en la columna **Pclass** igual a 2.

In [611]:
df_class2= df[(df["Fare"] < 33) & (df["Pclass"] == 2)]

In [612]:
df_class2

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,2,237736,30.0708
15,16,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,1,2,248706,16.0000
17,18,"Williams, Mr. Charles Eugene",male,NaN,1,2,244373,13.0000
20,21,"Fynney, Mr. Joseph J",male,35.0,0,2,239865,26.0000
21,22,"Beesley, Mr. Lawrence",male,34.0,1,2,248698,13.0000
...,...,...,...,...,...,...,...,...
866,867,"Duran y More, Miss. Asuncion",female,27.0,1,2,SC/PARIS 2149,13.8583
874,875,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,2,P/PP 3381,24.0000
880,881,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,1,2,230433,26.0000
883,884,"Banfield, Mr. Frederick James",male,28.0,0,2,C.A./SOTON 34068,10.5000
886,887,"Montvila, Rev. Juozas",male,27.0,0,2,211536,13.0000

### Ejercicio 6:
- Del resultado anterior obten el número de hombres y el número de mujeres.

In [613]:
df_class2["Sex"].value_counts()

Sex
male      95
female    68
Name: count, dtype: int64

### Ejercicio 7:
- Obten el costo total de los tickets de hombres y el costo total de los tickets de mujeres.

In [614]:
df_7f= df[df["Sex"] == "female"]
print(f"Costo total tickets de mujeres: {df_7f["Fare"].sum()}")

Costo total tickets de mujeres: 13966.6628

In [615]:
df_7m= df[df["Sex"] == "male"]
print(f"Costo total tickets de hombres: {df_7m["Fare"].sum()}")

Costo total tickets de hombres: 14727.286500000002

### Ejercicio 8:
- Obten el costo total de los tickets por cada clase (1, 2 y 3) y el número de pasajeros de cada clase.

In [616]:
df_class_1 = df[(df["Pclass"] == 1)]
df_class_1["Fare"].sum()

np.float64(18177.4125)

In [617]:
df_class_2 = df[(df["Pclass"] == 2)]
df_class_2["Fare"].sum()

np.float64(3801.8417)

In [618]:
df_class_3 = df[(df["Pclass"] == 3)]
df_class_3["Fare"].sum()

np.float64(6714.6951)

In [619]:
print(f"{df_class_1.shape[0]} pasajeros de 1ª clase")
print(f"{df_class_2.shape[0]} pasajeros de 2ª clase")
print(f"{df_class_3.shape[0]} pasajeros de 3ª clase")

216 pasajeros de 1ª clase
184 pasajeros de 2ª clase
491 pasajeros de 3ª clase

### Ejercicio 9:
- Crear una columna con el apellido de cada pasajero y agregala al DataFrame.

In [620]:
df.head()

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
0,1,"Braund, Mr. Owen Harris",male,22.0,0,3,A/5 21171,7.2500
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,1,PC 17599,71.2833
2,3,"Heikkinen, Miss. Laina",female,26.0,1,3,STON/O2. 3101282,7.9250
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,1,113803,53.1000
4,5,"Allen, Mr. William Henry",male,35.0,0,3,373450,8.0500

In [621]:
df["Last_name"]= df["Name"].str.split(",").str[0]
df.head()

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare,Last_name
0,1,"Braund, Mr. Owen Harris",male,22.0,0,3,A/5 21171,7.2500,Braund
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,1,PC 17599,71.2833,Cumings
2,3,"Heikkinen, Miss. Laina",female,26.0,1,3,STON/O2. 3101282,7.9250,Heikkinen
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,1,113803,53.1000,Futrelle
4,5,"Allen, Mr. William Henry",male,35.0,0,3,373450,8.0500,Allen

### Ejercicio 10:
- Encuentra si se repiten apellidos en la columna que se creo en el ejercicio anterior. (Usa _**.value_counts()**_)

In [622]:
df.duplicated("Last_name").value_counts()

False    667
True     224
Name: count, dtype: int64

In [623]:
df[df["Last_name"].duplicated()]

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare,Last_name
24,25,"Palsson, Miss. Torborg Danira",female,8.0,0,3,349909,21.0750,Palsson
38,39,"Vander Planke, Miss. Augusta Maria",female,18.0,0,3,345764,18.0000,Vander Planke
68,69,"Andersson, Miss. Erna Alexandra",female,17.0,1,3,3101281,7.9250,Andersson
71,72,"Goodwin, Miss. Lillian Amy",female,16.0,0,3,CA 2144,46.9000,Goodwin
88,89,"Fortune, Miss. Mabel Helen",female,23.0,1,1,19950,263.0000,Fortune
...,...,...,...,...,...,...,...,...,...
876,877,"Gustafsson, Mr. Alfred Ossian",male,20.0,0,3,7534,9.8458,Gustafsson
877,878,"Petroff, Mr. Nedelio",male,19.0,0,3,349212,7.8958,Petroff
885,886,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,3,382652,29.1250,Rice
887,888,"Graham, Miss. Margaret Edith",female,19.0,1,1,112053,30.0000,Graham
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,0,3,W./C. 6607,23.4500,Johnston

### Ejercicio 11:
- Encuentra los apellidos que se repiten en la columna recien creada. Es decir, solo muestra los apellidos que aparecen más de 1 vez.

In [624]:
df_11= df[df["Last_name"].duplicated()]

In [625]:
df_11["Last_name"].unique()

array(['Palsson', 'Vander Planke', 'Andersson', 'Goodwin', 'Fortune',
       'Moran', 'Turpin', 'Nasser', 'White', 'Nicola-Yarred', 'Futrelle',
       'Ford', 'Williams', 'Panula', 'Skoog', 'Rice', 'Johnson', 'Sage',
       'Asplund', 'Navratil', 'Olsen', 'Backstrom', 'Harris', 'Lefebre',
       'Zabour', 'Attalah', 'Strom', 'Smith', 'Baxter', 'Allison',
       'Kantor', 'Caldwell', 'Goldsmith', 'McCoy', 'Graham', 'Pears',
       'Brown', 'Arnold-Franchi', "O'Brien", 'Meyer', 'Gustafsson',
       'Holverson', 'Carter', 'Newell', 'Sandstrom', 'Johansson',
       'Olsson', 'Jussila', 'Hakkarainen', 'Hart', 'Minahan', 'Rosblom',
       'Richards', 'Mellinger', 'West', 'Baclini', 'Braund', 'Bishop',
       'Hoyt', 'Coutts', 'Hagland', 'Calic', 'Penasco y Castellana',
       'Webber', 'Hippach', 'Quick', 'Elias', 'Peter', 'Cacic', 'Beane',
       'Davies', 'Taussig', 'Flynn', 'Kelly', 'Silvey', 'Thayer',
       'Bourke', 'Van Impe', 'Boulos', 'Duff Gordon', 'Jacobsohn',
       'Laroche', 'Murphy', 'Danbom', 'Lobb', 'Becker', 'Nakid',
       'Collyer', 'Thorneycroft', 'Harper', 'Stanley', 'Doling',
       'Hickman', 'Frauenthal', 'Coleff', 'Chapman', 'Barbara', 'Hansen',
       'Morley', 'Moubarek', 'Taylor', 'Larsson', 'Jensen', 'Oreskovic',
       'Renouf', 'Allen', 'Ryerson', 'Crosby', 'Abbott', 'Herman',
       'Hamalainen', 'Hocking', 'Dick', 'Ali', 'Dean', 'Keane', 'Andrews',
       'Chambers', 'Hays', 'Moor', 'Lam', 'Mallet', 'Yasbeck', 'Saad',
       'Goldenberg', 'Svensson', 'Wick', 'Daly', 'Beckwith', 'Carlsson',
       'Abelson', 'Petroff', 'Johnston'], dtype=object)

### Ejercicio 12:
- Imprime los primeros 10 pasajeros que tengan un **PassengerID** multiplo de 3.

In [626]:
df_12= df[df["PassengerId"] % 3 == 0]

In [627]:
df_12.head(10)

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare,Last_name
2,3,"Heikkinen, Miss. Laina",female,26.0,1,3,STON/O2. 3101282,7.9250,Heikkinen
5,6,"Moran, Mr. James",male,NaN,0,3,330877,8.4583,Moran
8,9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,1,3,347742,11.1333,Johnson
11,12,"Bonnell, Miss. Elizabeth",female,58.0,1,1,113783,26.5500,Bonnell
14,15,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,3,350406,7.8542,Vestrom
17,18,"Williams, Mr. Charles Eugene",male,NaN,1,2,244373,13.0000,Williams
20,21,"Fynney, Mr. Joseph J",male,35.0,0,2,239865,26.0000,Fynney
23,24,"Sloper, Mr. William Thompson",male,28.0,1,1,113788,35.5000,Sloper
26,27,"Emir, Mr. Farred Chehab",male,NaN,0,3,2631,7.2250,Emir
29,30,"Todoroff, Mr. Lalio",male,NaN,0,3,349216,7.8958,Todoroff

### Ejercicio 13:
- ¿Cuales son los apellidos de los pasajeros que son mujeres y menores de 20 años?

In [628]:
df_13= df[(df["Sex"] == "female") & (df["Age"] < 20)]["Last_name"].unique()

In [629]:
df_13

array(['Nasser', 'Sandstrom', 'Vestrom', 'McGowan', 'Palsson',
       'Vander Planke', 'Nicola-Yarred', 'Laroche', 'Devaney',
       'Arnold-Franchi', 'West', 'Andersson', 'Goodwin', 'Ilett',
       'Zabour', 'Attalah', 'Newsom', 'Ford', 'Gilnagh', 'Johnson',
       'Kink-Heilmann', 'Andersen-Jensen', 'Strom', 'Carr', 'Asplund',
       'Collyer', 'Bishop', 'Allison', 'Penasco y Castellana', 'Ryerson',
       'Hippach', 'Nakid', 'Lehmann', 'Silven', 'Van Impe', 'Phillips',
       'Carter', 'Mellinger', 'Baclini', 'Hirvonen', 'Maioni', 'Quick',
       'Hart', 'Beane', 'Taussig', 'Becker', 'Skoog', 'Doling', 'Hegarty',
       'Turja', 'Madill', 'Karun', 'Astor', 'Barbara', 'Harper', 'Wells',
       'Emanuel', 'Ayoub', 'Dick', 'Sjoblom', 'Pettersson', 'Yasbeck',
       'Boulos', 'Lines', 'Aks', 'Najib', 'Graham'], dtype=object)

### Ejercicio 14:
- ¿Cuales son los apellidos de los pasajeros que son hombres y mayor de 45 años?

In [630]:
df_14= df[(df["Sex"] == "male") & (df["Age"] > 45)]["Last_name"].unique()

In [631]:
df_14

array(['McCarthy', 'Wheadon', 'Ostby', 'Chaffee', 'Coxon', 'Goldschmidt',
       'Porter', 'Connors', 'White', 'Bateman', 'Meo', 'Williams',
       'Van der hoef', 'Smith', 'Youseff', 'Green', 'Sjostedt', 'Carter',
       'Stead', 'Taussig', 'Duane', 'Moraweck', 'Nysveen', 'Partner',
       'McKane', 'Widegren', 'Silvey', 'Fortune', 'Peuchen', 'Goldenberg',
       'Millet', 'Anderson', 'Gee', 'Milling', 'Smart', 'Rouse', 'Kent',
       'Molson', 'Artagaveytia', 'Walker', 'Douglas', 'Nicholson',
       'Wright', 'Harris', 'Downton', 'Jarvis', 'Frolicher-Stehli',
       'Elsbury', 'Johnson', 'Duff Gordon', 'Sutton', 'Kirkland',
       'Barkworth', 'Lundahl', 'Harper', 'Simonius-Blumer', 'Newell',
       'Frauenthal', 'Colley', 'Mitchell', 'Brown', 'Weir', 'Chapman',
       'Thayer', 'Taylor', 'Greenberg', 'Hodges', 'Crosby', 'Jensen',
       'Guggenheim', 'Svensson', 'Daly', 'Vander Cruyssen'], dtype=object)

### Ejercicio 15:
- Compara si coinciden los apellidos generados en los ejercicios anteriores.

In [632]:
df_15 = set(df_13) & set (df_14)

In [633]:
df_15

{'Carter', 'Harper', 'Johnson', 'Taussig'}

### Ejercicio 16:
- Encuentra los 10 pasajeros que no sobrevivieron más jovenes e imprime cuantos son hombres y cuantos son mujeres.

In [634]:
df_16= df[(df["Survived"] == 0)].sort_values("Age").head(10)
df_16

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare,Last_name
164,165,"Panula, Master. Eino Viljami",male,1.0,0,3,3101295,39.6875,Panula
386,387,"Goodwin, Master. Sidney Leonard",male,1.0,0,3,CA 2144,46.9000,Goodwin
642,643,"Skoog, Miss. Margit Elizabeth",female,2.0,0,3,347088,27.9000,Skoog
824,825,"Panula, Master. Urho Abraham",male,2.0,0,3,3101295,39.6875,Panula
205,206,"Strom, Miss. Telma Matilda",female,2.0,0,3,347054,10.4625,Strom
16,17,"Rice, Master. Eugene",male,2.0,0,3,382652,29.1250,Rice
297,298,"Allison, Miss. Helen Loraine",female,2.0,0,1,113781,151.5500,Allison
119,120,"Andersson, Miss. Ellis Anna Maria",female,2.0,0,3,347082,31.2750,Andersson
7,8,"Palsson, Master. Gosta Leonard",male,2.0,0,3,349909,21.0750,Palsson
374,375,"Palsson, Miss. Stina Viola",female,3.0,0,3,349909,21.0750,Palsson

In [635]:
df_16["Sex"].value_counts()

Sex
male      5
female    5
Name: count, dtype: int64

### Ejercicio 17:
-  En un DataFrame muestra 3 pasajeros que sean hombres y 3 que sean mujeres, que hayan sobrevivido y para cada clase de la columna **Pclass**.

In [636]:
df_17= df[df["Survived"] == 1]
resultados = pd.DataFrame()

for pclass in df_17['Pclass'].unique():
    # Filtrar por clase
    df_pclass = df_17[df_17['Pclass'] == pclass]

    # Tomar 3 hombres y 3 mujeres
    male = df_pclass[df_pclass['Sex'] == 'male'].head(3)
    female = df_pclass[df_pclass['Sex'] == 'female'].head(3)

    # Concatenar los resultados
    resultados = pd.concat([resultados, male, female])

In [637]:
resultados

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare,Last_name
23,24,"Sloper, Mr. William Thompson",male,28.00,1,1,113788,35.5000,Sloper
55,56,"Woolner, Mr. Hugh",male,NaN,1,1,19947,35.5000,Woolner
97,98,"Greenfield, Mr. William Bertram",male,23.00,1,1,PC 17759,63.3583,Greenfield
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.00,1,1,PC 17599,71.2833,Cumings
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.00,1,1,113803,53.1000,Futrelle
11,12,"Bonnell, Miss. Elizabeth",female,58.00,1,1,113783,26.5500,Bonnell
36,37,"Mamee, Mr. Hanna",male,NaN,1,3,2677,7.2292,Mamee
65,66,"Moubarek, Master. Gerios",male,NaN,1,3,2661,15.2458,Moubarek
74,75,"Bing, Mr. Lee",male,32.00,1,3,1601,56.4958,Bing
2,3,"Heikkinen, Miss. Laina",female,26.00,1,3,STON/O2. 3101282,7.9250,Heikkinen
8,9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.00,1,3,347742,11.1333,Johnson
10,11,"Sandstrom, Miss. Marguerite Rut",female,4.00,1,3,PP 9549,16.7000,Sandstrom
17,18,"Williams, Mr. Charles Eugene",male,NaN,1,2,244373,13.0000,Williams
21,22,"Beesley, Mr. Lawrence",male,34.00,1,2,248698,13.0000,Beesley
78,79,"Caldwell, Master. Alden Gates",male,0.83,1,2,248738,29.0000,Caldwell
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.00,1,2,237736,30.0708,Nasser
15,16,"Hewlett, Mrs. (Mary D Kingcome)",female,55.00,1,2,248706,16.0000,Hewlett
43,44,"Laroche, Miss. Simonne Marie Anne Andree",female,3.00,1,2,SC/Paris 2123,41.5792,Laroche

### Ejercicio 18:
- Obtener el tipo de elementos de cada columna y convierte los que sean "int64" a "int32". Evalua la memoria que consume antes y después de convertir las columnas y comenta la diferencia.

In [638]:
df.info() # 55.8+ KB

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Name         891 non-null    object
 2   Sex          891 non-null    object
 3   Age          714 non-null    float64
 4   Survived     891 non-null    int64
 5   Pclass       891 non-null    int64
 6   Ticket       891 non-null    object
 7   Fare         891 non-null    float64
 8   Last_name    891 non-null    object
dtypes: float64(2), int64(3), object(4)
memory usage: 62.8+ KB

In [639]:
df[["PassengerId", "Survived", "Pclass"]] = df[["PassengerId", "Survived", "Pclass"]].astype("int32")

In [640]:
df.info() # 45.4+KB

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int32
 1   Name         891 non-null    object
 2   Sex          891 non-null    object
 3   Age          714 non-null    float64
 4   Survived     891 non-null    int32
 5   Pclass       891 non-null    int32
 6   Ticket       891 non-null    object
 7   Fare         891 non-null    float64
 8   Last_name    891 non-null    object
dtypes: float64(2), int32(3), object(4)
memory usage: 52.3+ KB

### Ejercicio 19:
- Encuentra a los pasajeros de la clase 1 y 3 entre 20 y 25 años y comprueba si son más hombres o mujeres.

In [641]:
df19= df[(df["Pclass"].isin([1,3])) & (df["Age"].between(20,25))]
df19["Sex"].value_counts()

Sex
male      73
female    34
Name: count, dtype: int64

### Ejercicio 20:
- Agrega una nueva columna al DataFrame que se llame: "Rango edad" y va a categorizar de la siguiente manera:
    - Niño < 11 años
    - Joven < 18 años
    - Adulto < 50 años
    - Mayor >= 50 años

In [642]:
df20= df.copy()

In [643]:
def rango_edad(edad):
    if edad < 11:
        return "niño"
    elif edad < 18:
        return "joven"
    elif edad < 50:
        return "adulto"
    else:
        return "mayor"
    
df20["Rango_edad"] = df20["Age"].apply(rango_edad)
df20.head(10)

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare,Last_name,Rango_edad
0,1,"Braund, Mr. Owen Harris",male,22.0,0,3,A/5 21171,7.2500,Braund,adulto
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,1,PC 17599,71.2833,Cumings,adulto
2,3,"Heikkinen, Miss. Laina",female,26.0,1,3,STON/O2. 3101282,7.9250,Heikkinen,adulto
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,1,113803,53.1000,Futrelle,adulto
4,5,"Allen, Mr. William Henry",male,35.0,0,3,373450,8.0500,Allen,adulto
5,6,"Moran, Mr. James",male,NaN,0,3,330877,8.4583,Moran,mayor
6,7,"McCarthy, Mr. Timothy J",male,54.0,0,1,17463,51.8625,McCarthy,mayor
7,8,"Palsson, Master. Gosta Leonard",male,2.0,0,3,349909,21.0750,Palsson,niño
8,9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,1,3,347742,11.1333,Johnson,adulto
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,2,237736,30.0708,Nasser,joven

### Ejercicio 21:
- Encontrar a los pasajeros "jovenes" y "mayores" de la clase 2 y 3 que hayan sobrevivido. Imprimir los 10 primeros.

In [644]:
df21= df20[(df20["Rango_edad"].isin(["joven", "mayor"])) & (df20["Pclass"] > 1) & (df["Survived"] == 1)]

In [645]:
df21.head(10)

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare,Last_name,Rango_edad
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,2,237736,30.0708,Nasser,joven
15,16,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,1,2,248706,16.0000,Hewlett,mayor
17,18,"Williams, Mr. Charles Eugene",male,NaN,1,2,244373,13.0000,Williams,mayor
19,20,"Masselmani, Mrs. Fatima",female,NaN,1,3,2649,7.2250,Masselmani,mayor
22,23,"McGowan, Miss. Anna ""Annie""",female,15.0,1,3,330923,8.0292,McGowan,joven
28,29,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,1,3,330959,7.8792,O'Dwyer,mayor
32,33,"Glynn, Miss. Mary Agatha",female,NaN,1,3,335677,7.7500,Glynn,mayor
36,37,"Mamee, Mr. Hanna",male,NaN,1,3,2677,7.2292,Mamee,mayor
39,40,"Nicola-Yarred, Miss. Jamila",female,14.0,1,3,2651,11.2417,Nicola-Yarred,joven
47,48,"O'Driscoll, Miss. Bridget",female,NaN,1,3,14311,7.7500,O'Driscoll,mayor

### Ejercicio 22:
- Encuentra la edad promedio de todos los pasajeros y reemmplazala por los **NaN** en la columna de **Age** y ejecuta el ejercicio anterior.

In [646]:
df["Age"].mean()

np.float64(29.69911764705882)

In [647]:
df["Age"]= df["Age"].fillna(29)

### Ejercicio 23:
- Cambia a español la columna **Sex**.

In [648]:
df23= df.rename(columns= {"Sex": "Genero"})
df23.replace({"male": "masculino",
              "female" : "femenino"})

,PassengerId,Name,Genero,Age,Survived,Pclass,Ticket,Fare,Last_name
0,1,"Braund, Mr. Owen Harris",masculino,22.0,0,3,A/5 21171,7.2500,Braund
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",femenino,38.0,1,1,PC 17599,71.2833,Cumings
2,3,"Heikkinen, Miss. Laina",femenino,26.0,1,3,STON/O2. 3101282,7.9250,Heikkinen
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",femenino,35.0,1,1,113803,53.1000,Futrelle
4,5,"Allen, Mr. William Henry",masculino,35.0,0,3,373450,8.0500,Allen
...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",masculino,27.0,0,2,211536,13.0000,Montvila
887,888,"Graham, Miss. Margaret Edith",femenino,19.0,1,1,112053,30.0000,Graham
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",femenino,29.0,0,3,W./C. 6607,23.4500,Johnston
889,890,"Behr, Mr. Karl Howell",masculino,26.0,1,1,111369,30.0000,Behr
890,891,"Dooley, Mr. Patrick",masculino,32.0,0,3,370376,7.7500,Dooley

### Ejercicio 24:
- Convierte a mayusculas todas las columnas que los valores sean cadenas.

In [649]:
df24= df.copy()
df24.dtypes.to_dict().items()

dict_items([('PassengerId', dtype('int32')), ('Name', dtype('O')), ('Sex', dtype('O')), ('Age', dtype('float64')), ('Survived', dtype('int32')), ('Pclass', dtype('int32')), ('Ticket', dtype('O')), ('Fare', dtype('float64')), ('Last_name', dtype('O'))])

In [650]:
for nombre_columna, tipo_dato in df24.dtypes.to_dict().items():
    if tipo_dato == "object":        
        df24[nombre_columna] = df24[nombre_columna]. apply(lambda x : x.upper())

In [651]:
df24.head(5)

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare,Last_name
0,1,"BRAUND, MR. OWEN HARRIS",MALE,22.0,0,3,A/5 21171,7.2500,BRAUND
1,2,"CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS TH...",FEMALE,38.0,1,1,PC 17599,71.2833,CUMINGS
2,3,"HEIKKINEN, MISS. LAINA",FEMALE,26.0,1,3,STON/O2. 3101282,7.9250,HEIKKINEN
3,4,"FUTRELLE, MRS. JACQUES HEATH (LILY MAY PEEL)",FEMALE,35.0,1,1,113803,53.1000,FUTRELLE
4,5,"ALLEN, MR. WILLIAM HENRY",MALE,35.0,0,3,373450,8.0500,ALLEN

### Ejercicio 25:
- Agrupa por sexo y rango de edad y encuentra la edad promedio.

In [652]:
df25= df20.groupby(["Sex", "Rango_edad"])["Age"].mean()
df25

Sex     Rango_edad
female  adulto        30.260870
        joven         15.229167
        mayor         55.000000
        niño           4.596774
male    adulto        30.196793
        joven         15.320000
        mayor         58.615385
        niño           3.959697
Name: Age, dtype: float64

### Ejercicio 26:
- Divide la columna name en las siguientes columnas:
    - Mrs/Miss
    - Apellido
    - Nombre(s)
    
**Nota: Ignora el resto de información.**

In [653]:
df26= df.copy()

In [654]:
apellido = df26['Name'].str.split(', ', expand=True)

df26['Apellido'] = apellido[0]

titulo_nombre = apellido[1].str.split('.', expand=True)
df26['Titulo'] = titulo_nombre[0]
df26['Nombre'] = titulo_nombre[1].str.strip()

df26.drop(["Name", "Last_name"], axis=1, inplace=True)
df26.head(1)

,PassengerId,Sex,Age,Survived,Pclass,Ticket,Fare,Apellido,Titulo,Nombre
0,1,male,22.0,0,3,A/5 21171,7.25,Braund,Mr,Owen Harris

In [655]:
################################################################################################################################